In [4]:
from langchain_community.utilities import SQLDatabase

db = SQLDatabase.from_uri("sqlite:///" + "spider_data/database/car_1/car_1.sqlite")
print(db.dialect)
print(db.get_usable_table_names())

sqlite
['car_makers', 'car_names', 'cars_data', 'continents', 'countries', 'model_list']

In [7]:
import pandas as pd


def query(db: SQLDatabase, query: str):
    df = pd.read_sql(query, db._engine)
    return df


query(
    db,
    "SELECT T1.Make , T2.Year FROM car_names AS T1 INNER JOIN cars_data AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year ASC LIMIT 1",
)

                        Make  Year
0  chevrolet chevelle malibu  1970